
/* BigNumberの設定　小数桁数精度 */
BigNumber.config({ DECIMAL_PLACES: 25 }); // 計算精度
window.calcRoundDegit = 25; // 出力累積計算の丸め位置
window.exportRoundDegit = 12; // 出力結果の丸め位置
BigNumber.one  = BigNumber(1); //頻出キャッシュ
BigNumber.zero = BigNumber(0); 

/* Decimal.jsの設定　有効桁数精度 */
Decimal.set({ precision: 40 }); // 計算制度
Decimal.one  = Decimal(1);
Decimal.zero = Decimal(0);

/* ---- 転生データ ------------------------------------------- */

const 転生基準値リスト = {};


/* 武器転生の基準値
*   0: lv, 1: status1, 2: status2, 3: all%, 4: (ama), 5: hpmp
* , 6: def, 7: declv, 8: dam, 9: bossdam
*/

転生基準値リスト.武器 = [
  [  0, 1,1,1,1,  3, 1,5,1,2],
  [ 10, 1,1,1,1, 30, 1,5,1,2],
  [ 20, 2,1,1,1, 60, 2,5,1,2],
  [ 30, 2,1,1,1, 90, 2,5,1,2],
  [ 40, 3,2,1,1,120, 3,5,1,2],
  [ 50, 3,2,1,1,150, 3,5,1,2],
  [ 60, 4,2,1,1,180, 4,5,1,2],
  [ 70, 4,2,1,1,210, 4,5,1,2],
  [ 80, 5,3,1,1.240, 5,5,1,2],
  [ 90, 5,3,1,1.270, 5,5,1,2],
  [100, 6,3,1,1,300, 6,5,1,2],
  [110, 6,3,1,1,330, 6,5,1,2],
  [120, 7,4,1,1,360, 7,5,1,2],
  [130, 7,4,1,1,390, 7,5,1,2],
  [140, 8,4,1,1,420, 8,5,1,2],
  [150, 8,4,1,1,450, 8,5,1,2],
  [160, 9,5,1,1,480, 9,5,1,2],
  [200,11,6,1,1,600,11,5,1,2],
  [201,12,7,1,1,700,12,5,1,2]
];

/* 防具転生の基準値
*   0: lv, 1: status1, 2: status2, 3: all%, 4: ama, 5: hpmp
* , 6: def, 7: declv, 8: spd, 9: jump
*/

転生基準値リスト.防具 = [
  [  0, 1,1,1,1,  3, 1,5,1,1],
  [ 10, 1,1,1,1, 30, 1,5,1,1],
  [ 20, 2,1,1,1, 60, 2,5,1,1],
  [ 30, 2,1,1,1, 90, 2,5,1,1],
  [ 40, 3,2,1,1,120, 3,5,1,1],
  [ 50, 3,2,1,1,150, 3,5,1,1],
  [ 60, 4,2,1,1,180, 4,5,1,1],
  [ 70, 4,2,1,1,210, 4,5,1,1],
  [ 80, 5,3,1,1.240, 5,5,1,1],
  [ 90, 5,3,1,1.270, 5,5,1,1],
  [100, 6,3,1,1,300, 6,5,1,1],
  [110, 6,3,1,1,330, 6,5,1,1],
  [120, 7,4,1,1,360, 7,5,1,1],
  [130, 7,4,1,1,390, 7,5,1,1],
  [140, 8,4,1,1,420, 8,5,1,1],
  [150, 8,4,1,1,450, 8,5,1,1],
  [160, 9,5,1,1,480, 9,5,1,1],
  [200,11,6,1,1,600,11,5,1,1],
  [201,12,7,1,1,700,12,5,1,1]
];

const 列数抽選率リスト = {
  転生の炎: [0, 40, 40, 16, 4]
, 転生ラバ: [0,  0,  0,  0, 100]
, 製作職人: [0, 21, 50, 25, 4]
, 製作名匠: [0,  0, 56, 40, 4]
, その他:   [0, 41, 40, 15, 4]
};

const ランク抽選率リスト = {
  転生深淵: [  0,  0, 63, 34,  3],
  転生永遠: [  0, 29, 45, 25,  1],
  転生強力: [ 20, 30, 36, 14,  0],
  転生一般: [ 50, 40,  9,  1,  0],
  転生ラバ: [ 65, 25, 12,  3,  0], /* 確率不明 約50個分のデータから推測 R5未確認 */
  合成名匠: [  0, 40, 45, 14,  1],
  合成職人: [ 25, 35, 30, 10,  0],
  合成一般: [ 50, 40, 10,  0,  0],
  製作名匠: [  0, 19, 50, 30,  1],
  製作職人: [ 15, 30, 40, 14,  1],
  製作一般: [ 50, 40, 10,  0,  0],
  ドロップ: [ 25, 30, 30, 14,  1],
  欠片交換: [ 25, 30, 30, 14,  1],
  チャンスタイム: [  0, 30, 50, 19,  1],
  その他: [ 25, 30, 30, 14,  1],
};

const 転生確率 = {
  転生深淵:{
    列数: 列数抽選率リスト.転生の炎
  }
, 転生永遠:{
    列数: 列数抽選率リスト.転生の炎
  }
, 転生強力:{
    列数: 列数抽選率リスト.転生の炎
  }
, 転生一般:{
    列数: 列数抽選率リスト.転生の炎
  }
, 転生ラバ:{
    列数: 列数抽選率リスト.転生ラバ
  }
, 合成名匠:{
    列数: 列数抽選率リスト.製作名匠
  }
, 合成職人:{
    列数: 列数抽選率リスト.製作職人
  }
, 合成一般:{
    列数: 列数抽選率リスト.その他
  }
, 製作名匠:{
    列数: 列数抽選率リスト.製作名匠
  }
, 製作職人:{
    列数: 列数抽選率リスト.製作職人
  }
, 製作一般:{
    列数: 列数抽選率リスト.その他
  }
, ドロップ:{
    列数: 列数抽選率リスト.その他
  }
, 欠片交換:{
    列数: 列数抽選率リスト.その他
  }
, チャンスタイム:{
    列数: 列数抽選率リスト.その他
  }
, その他:{
    列数: 列数抽選率リスト.その他
  }
};

{ // 整合性チェック　キー名が対応しているか
  const a = Object.keys(ランク抽選率リスト);
  const b = Object.keys(転生確率);
  if ( a.length !== b.length || !a.every(v => b.includes(v)) ){
    console.error("整合性チェック", "キー名が対応していない", ランク抽選率リスト, 転生確率);
  }
}

Object.keys(転生確率).forEach( key => {
  転生確率[key].ランク = ランク抽選率リスト[key];
});

const 転生オプション = {武器:[], 防具:[]};
{// 転生オプション.武器/防具
  const commonoptions = [
    "str", "dex", "int", "luk",
    "strdex", "strint", "strluk", "dexint", "dexluk", "intluk",
    "all", "atk", "matk", "hp", "mp", "def", "declv",
  ];
  転生オプション.武器 = [
    ...commonoptions, "dam", "bossdam", 
  ];
  転生オプション.防具 = [
    ...commonoptions, "spd", "jump", 
  ];
};

const 転生基準値インデックス = {
  "str": 1, "dex": 1, "int": 1, "luk": 1,
  "strdex": 2, "strint": 2, "strluk": 2, "dexint": 2, "dexluk": 2, "intluk": 2,
  "all": 3, "atk": 4, "matk": 4, "hp": 5, "mp": 5, "def": 6, "declv": 7,
  "dam": 8, "bossdam": 9,
  "spd": 8, "jump": 9,
};

const コモンフォーム名リスト = [
  "isarmor", "eqplv", "rtype", "min", "isboss", "issimpleatk"
, "simpleatk", "weaponatk"
];

/* 武器防具で分ける */
const スコアフォーム名リスト = {};

/* 武器スコア入力欄 */
スコアフォーム名リスト.武器 = [
  "str", "dex", "int", "luk",
  "all", "atk", "hp", "dam",
];

/* 防具スコア入力欄 */
スコアフォーム名リスト.防具 = [
  "str", "dex", "int", "luk",
  "all", "atk", "hp",
];

const スコアフォーム名テキスト = {
  "str": "STR",
  "dex": "DEX",
  "int": "INT",
  "luk": "LUK",
  "all": "全ステ%",
  "atk": "攻撃/魔力",
  "hp": "HP",
  "dam": "総ダメ%",
};
const 転生セレクト = [
  "転生深淵", "転生永遠", "転生強力", /*"転生一般"*/, "転生ラバ",
  "合成名匠", "合成職人", "合成一般",
  "製作名匠", "製作職人", "製作一般",
  "ドロップ", "欠片交換", /*"チャンスタイム"*/
  "その他"
];
const 転生セレクト名リスト = {
  "転生深淵": "転生：深淵",
  "転生永遠": "転生：永遠/黒い/メル",
  "転生強力": "転生：強力",
  "転生一般": "転生：一般",
  "転生ラバ": "転生：ラバストーン",
  "合成名匠": "合成：名匠",
  "合成職人": "合成：職人",
  "合成一般": "合成：一般",
  "製作名匠": "製作：名匠",
  "製作職人": "製作：職人",
  "製作一般": "製作：一般",
  "ドロップ": "ドロップ",
  "欠片交換": "欠片交換",
  "チャンスタイム":"チャンスタイム",
  "その他": "その他",
};

const 転生アイコン名リスト = {
  "転生深淵": "深淵",
  "転生永遠": "永遠",
  "転生強力": "強力",
  "転生一般": "一般",
  "転生ラバ": "ラバ",
  "合成名匠": "合成", "合成職人": "合成", "合成一般": "合成",
  "製作名匠": "製作", "製作職人": "製作", "製作一般": "製作",
  "ドロップ": "その他", "欠片交換": "その他", "チャンスタイム":"その他", "その他": "その他",
};


const レベルセレクト = [250, 200, 160, 150, 140, 130, 120, 110, 100, 0];
const レベルセレクト名リスト = Object.fromEntries(
  レベルセレクト.map(lv => [lv, lv])
);


/* cookie処理用フォーム名リスト */
const formnames = [...コモンフォーム名リスト, ...スコアフォーム名リスト.武器, ...スコアフォーム名リスト.防具]
                  .filter( e => e !== "");
// 順列の省略用。permutations[n] == n!
const permutations = [
  1, 1, 2, 6, 24,
];
// 組み合わせ計算の省略用。combinations[n][m]でnCmを取り出す(n<=19,m<=4)
const combinations = [
  [1, 0, 0, 0, 0],
  [1, 1, 0, 0, 0],
  [1, 2, 1, 0, 0],
  [1, 3, 3, 1, 0],
  [1, 4, 6, 4, 1],
  [1, 5, 10, 10, 5],
  [1, 6, 15, 20, 15],
  [1, 7, 21, 35, 35],
  [1, 8, 28, 56, 70],
  [1, 9, 36, 84, 126],
  [1, 10, 45, 120, 210],
  [1, 11, 55, 165, 330],
  [1, 12, 66, 220, 495],
  [1, 13, 78, 286, 715],
  [1, 14, 91, 364, 1001],
  [1, 15, 105, 455, 1365],
  [1, 16, 120, 560, 1820],
  [1, 17, 136, 680, 2380],
  [1, 18, 153, 816, 3060],
  [1, 19, 171, 969, 3876]
];

const 出力タイプ名リスト = [
  "numavg", "num50", "num95",
  "prob1", "prob100", "prob10000",
];

const 出力タイプ名テキスト = {
  "numavg": "平均消費数[個]",
  "num50": "50%ライン[個]",
  "num95": "95%ライン[個]",
  "prob1": "個で出る確率[x1]",
  "prob100": "個で出る確率[x100]",
  "prob10000": "個で出る確率[x10000]",
};

function getAtkTensei(lv, rank, isboss){
  if (rank < 1) return BigNumber.zero;
  if (lv > 200) lv = 250;
  lv = ~~(lv/40) + 1;
  const r1 = rank;
  const r2 = r1 + isboss * 2;
  let atktensei = BigNumber( 1.1 ).pow( r1-1 ).times( lv ).times( r2 );
  return atktensei;
}

/* ---- 汎用関数 ----------------------------------------------------------- */
// 入力値を正規化して取得 (invaild:-1, 空: 0)
function getValue(el){
  const tag = el.tagName.toLocaleLowerCase();
  const type = el.type.toLocaleLowerCase();
  if (tag === "input"){
    if (type === "checkbox"){
      return el.checked;
    } else {
      let val = +el.value.trim();
      if (Number.isNaN(val)) return null;
      return val;
    }
  }
  if (tag === "select"){
    return el.value;
  }
}
/* ---- cookie ----------------------------------------------------- */
function setCookie(name, value, days = 365) {
  const expires = new Date(Date.now() + days * 864e5).toUTCString();
  document.cookie = `${name}=${encodeURIComponent(value)}; expires=${expires}; path=/`;
}

function getCookie(name) {
  return document.cookie.split("; ").reduce((r, v) => {
    const [key, val] = v.split("=");
    return key === name ? decodeURIComponent(val) : r;
  }, null);
}
